window.gameQuestions = window.gameQuestions || {};

// أسئلة مفتوحة تعتمد على ذكر عدد من العناصر
window.gameQuestions.dress_friend = [
    "اذكر لاعبين محترفين لعبوا في الدوري المصري.",
    "اذكر أندية فازت بدوري أبطال أوروبا في آخر 10 سنوات.",
    "اذكر حراس مرمى لعبوا في نادي الإسماعيلي.",
    "اذكر منتخبات وصلت إلى نصف نهائي كأس العالم 2018.",
    "اذكر لاعبين حصلوا على جائزة أفضل لاعب في إفريقيا.",
    "اذكر مدربين تولوا تدريب الزمالك في آخر 20 سنة.",
    "اذكر لاعبين في قايمة المنتخب الأرجنتين بكأس العالم 2022.",
    "اذكر منتخبات عربية شاركت في كأس العالم.",
    "اذكر لاعبين سجلوا أهداف في مرماهم بالخطأ."
];