window.gameQuestions = window.gameQuestions || {};

// أسئلة مفتوحة تعتمد على ذكر عدد من العناصر
window.gameQuestions.dress_friend = [
    "اذكر أندية لعب لها زلاتان إبراهيموفيتش.",
    "اذكر لاعبين تونسيين في الدوري المصري.",
    "اذكر منتخبات فازت بكأس العالم.",
    "اذكر محترفين لعبوا في النادي الأهلي.",
    "اذكر لاعبين حصلوا على جائزة هداف الدوري الإنجليزي.",
    "اذكر أندية فازت بكأس الرابطة المصري.",
    "اذكر مدربين فازوا بدوري أبطال أوروبا مع أكثر من فريق.",
    "اذكر لاعبين مصريين شاركوا في كأس العالم 2018.",
    "اذكر أندية نافست على الدوري الإسباني موسم 2024-2025."
];