window.gameQuestions = window.gameQuestions || {};

window.gameQuestions.who_am_i = [
    {
        name: "نور الدين أمرابط",
        image: "images/players/amrabat.png",
        clues: [
            "أنا لعبت مع دروجبا، أيمانويل أيـبـويـه، شنايدر، إبراهيم أفلاي، سانتا كروز، مايكون، ريتشارليسون وأحمد موسى",
            "أنا اتأسست كلاعب في أكاديمية أياكس، ولعبت أول ماتش ليا في دوري الأبطال مع أيندهوفن، ولعبت مع منتخب هولندا تحت 21 سنة.",
            "أنا لعبت في 6 دوريات موجودين في قارتين، وفزت بالدوري في 3 منهم، مرة فيهم كانت في السعودية وكسبت وقتها جايزة أحسن صانع ألعاب.",
            "بلعب دلوقتي مع فريق عربي أفريقي لعب في كأس العالم للأندية 2025.",
            "لعبت مع منتخب المغرب في بطولتين أمم أفريقيا وفي كأس العالم 2018."
        ]
    },
    {
        name: "أسامة نبيه",
        image: "images/players/nabih.png",
        clues: [
            "كسبت الدوري المصري ودوري أبطال أفريقيا والسوبر المصري والأفريقي.",
            "عندي تجربة أحتراف في الدوري الكويتي، وتجربة تانية في الدوري التركي.",
            "كسبت ميداليتين دهب مع منتخب مصر في أعمار سنية مختلفة، وعمري ما لعبت في الأهلي",
            "أشتغلت مدرب في أندية في السعودية والسودان.",
            "كنت في الجهاز الفني لمنتخب مصر الأول مع كذا مدرب زي شوقي غريب وهيكتور كوبر."
        ]
    },
    {
        name: "كريستيانو رونالدو",
        image: "images/players/ronaldo.png",
        clues: [
            "أنا لعبت مع كاكا، دانيلو، فابينيو، كاسيميرو، مارسيلو، دوديك، أديبايور، بيكيه، فورلان، فان دير فارت، دي ليخت، وسامي خضيرة.",
            "أنا لعبت في 5 دوريات مختلفة خلال مسيرتي، وفزت بتلات دوريات منهم.",
            "أنجح فترة في حياتي كانت في إسبانيا، لما فزت بالدوري والكأس مرتين، كسبت جايزة أحسن لاعب مرة.",
            "عيلة أبويا في الأساس من الرأس الأخضر.",
            "أبويا سماني على أسم رئيس أمريكي كان بيمثل وأبويا كان بيحبه."
        ]
    }
];