window.gameQuestions = window.gameQuestions || {};

// Questions for the "Lie Correctly" game
// Each object has a question (q) and the correct answer (a)
window.gameQuestions.lie_correctly = [
    { 
        "q": "ايه هو عدد الأندية التي لعب لها زلاتان إبراهيموفيتش خلال مسيرته الاحترافية؟",
        "a": "9"
    },
    { 
        "q": "ايه هو عدد الماتشات اللي كسبها الأرسنال في موسم اللا هزيمة؟",
        "a": "26"
    },
    { 
        "q": "جيرد مولر لعب 62 مبارة مع منتخب المانيا، جاب كام جون فيهم؟",
        "a": "68"
    },
    { 
        "q": "راؤول جونزاليس هو تالت أفضل هداف في تاريخ ريال مدريد بكام هدف؟",
        "a": "323"
    },
    { 
        "q": "الحارس الأمريكي تيم هاورد في ماتش سنة 2014 قدام منتخب بلجيكا، عمل عدد تصديات قياسي كأكبر عدد تصديات في مبارة واحدة، كانوا كام صدة؟ ",
        "a": "16 صدة"
    },
    { 
        "q": "ما هي سعة ملعب توتنهام هوتسبير الحالية؟",
        "a": "62 الف"
    },
    {
        "q": "كام هي عدد مشاركات كريستيانو رونالدو مع ريال مدريد في جميع المسابقات الرسمية؟",
        "a": "438"
    },
    {
        "q": "عماد متعب هو الرابع في ترتيب أفضل هدافين في تاريخ النادي الأهلي بكام هدف؟",
        "a": "121"
    },
    {
        "q": "في ترتيب هدافين الدوري الإنجليزي موسم 2024-2025، كان الأول محمد صلاح بـ 29 جون، هالاند ختم الموسم ده جايب كام جون وقتها؟",
        "a": "21"
    },
    {
        "q": " صامويل إيتو كسب مع برشلونة كام بطولة رسمية في الفترة اللي لعبها معاهم؟",
        "a": "8 بطولات"
    }
];